{"backend": "theano", "config": [{"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "dtype": "float32", "activity_regularizer": null, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "filters": 32, "use_bias": true, "activation": "linear", "kernel_constraint": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "filters": 32, "use_bias": true, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "units": 128, "name": "dense_1", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "name": "dense_2", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.8"}